Q2499279972/CY8CMBR3xxx_Host_APIs/API/CY8CMBR3xxx_APIs.c
/*****************************************************************************
* File Name: CY8CMBR3xxx_APIs.c
*
* Version 1.00
*
* Description:
*   This file contains the definitions of all the high-level APIs.
*
* Note:
*   N/A
*
* Owner:
*   SRVS
*
* Related Document:
*   MBR3 Design Guide
*   MBR3 Device Register TRM
*   MBR3 Device Datasheet
*
* Hardware Dependency:
*   N/A
*
* Code Tested With:
*   PSoC Creator 3.0 CP7
*   CY3280-MBR3 Evaluation Kit
*   CY8CKIT-042 Pioneer Kit
*
******************************************************************************
* Copyright (2014), Cypress Semiconductor Corporation.
******************************************************************************
* This software is owned by Cypress Semiconductor Corporation (Cypress) and is
* protected by and subject to worldwide patent protection (United States and
* foreign), United States copyright laws and international treaty provisions.
* Cypress hereby grants to licensee a personal, non-exclusive, non-transferable
* license to copy, use, modify, create derivative works of, and compile the
* Cypress Source Code and derivative works for the sole purpose of creating
* custom software in support of licensee product to be used only in conjunction
* with a Cypress integrated circuit as specified in the applicable agreement.
* Any reproduction, modification, translation, compilation, or representation of
* this software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: CYPRESS MAKES NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH
* REGARD TO THIS MATERIAL, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
* Cypress reserves the right to make changes without further notice to the
* materials described herein. Cypress does not assume any liability arising out
* of the application or use of any product or circuit described herein. Cypress
* does not authorize its products for use as critical components in life-support
* systems where a malfunction or failure may reasonably be expected to result in
* significant injury to the user. The inclusion of Cypress' product in a life-
* support systems application implies that the manufacturer assumes all risk of
* such use and in doing so indemnifies Cypress against all charges. Use may be
* limited by and subject to the applicable Cypress software license agreement.
*****************************************************************************/

/*******************************************************************************
* Included headers
*******************************************************************************/
#include "CY8CMBR3xxx_APIs.h"
#include "CY8CMBR3xxx_Device.h"
#include "CY8CMBR3xxx_Registers.h"
#include "CY8CMBR3xxx_CommandsAndConfig.h"
#include "CY8CMBR3xxx_HostFunctions.h"


/*******************************************************************************
* Address Validation Macro
*******************************************************************************/
#define CY8CMBR3xxx_SLAVE_ADDRESS_MIN                            (0x08)
#define CY8CMBR3xxx_SLAVE_ADDRESS_MAX                            (0x77)
#define CY8CMBR3xxx_IS_VALID_ADDRESS(address)                    ((slaveAddress >= CY8CMBR3xxx_SLAVE_ADDRESS_MIN) && (slaveAddress <= CY8CMBR3xxx_SLAVE_ADDRESS_MAX))


/*******************************************************************************
* Critical Delay Constants
*******************************************************************************/
#define CY8CMBR3xxx_DELAY_SAVE_CHECK_CRC_CMD                     (250)
#define CY8CMBR3xxx_DELAY_SOFTWARE_RESET_CMD                     (50)


/*******************************************************************************
* API Constants
*******************************************************************************/
#define CY8CMBR3xxx_COMMAND_STATUS_BUSY                          (0)
#define CY8CMBR3xxx_COMMAND_STATUS_SUCCESS                       (1)
#define CY8CMBR3xxx_COMMAND_STATUS_FAILED                        (2)
#define CY8CMBR3xxx_REG_ADDRESS_LENGTH                           (1)
#define CY8CMBR3xxx_CONFIG_DATA_LENGTH_WITH_CRC_AND_ADDR         (129)
#define CY8CMBR3xxx_MAX_DEVICE_REGISTERS                         (252)
#define CY8CMBR3xxx_COMMAND_NO_ERROR                             (0)
#define CY8CMBR3xxx_REG_ADDRESS_OFFSET                           (0)
#define CY8CMBR3xxx_WRITE_DATA_LSB_OFFSET                        (1)
#define CY8CMBR3xxx_WRITE_DATA_MSB_OFFSET                        (2)
#define CY8CMBR3xxx_BYTE_WRITE_LENGTH                            (2)
#define CY8CMBR3xxx_BYTE_READ_LENGTH                             (1)
#define CY8CMBR3xxx_DUAL_BYTE_WRITE_LENGTH                       (3)
#define CY8CMBR3xxx_DUAL_BYTE_READ_LENGTH                        (2)
#define CY8CMBR3xxx_READ_DATA_LSB_OFFSET                         (0)
#define CY8CMBR3xxx_READ_DATA_MSB_OFFSET                         (1)
#define CY8CMBR3xxx_CONFIG_DATA_LENGTH_WITH_CRC                  (128)
#define CY8CMBR3xxx_COMMAND_SEND_LENGTH                          (2)
#define CY8CMBR3xxx_COMMAND_OFFSET                               (1)
#define CY8CMBR3xxx_COMMAND_STATUS_LENGTH                        (4)
#define CY8CMBR3xxx_CMD_STAT_CTRL_CMD_OFFSET                     (0)
#define CY8CMBR3xxx_CMD_STAT_CTRL_CMD_STATUS_OFFSET              (2)
#define CY8CMBR3xxx_CMD_STAT_CTRL_CMD_ERR_OFFSET                 (3)
#define CY8CMBR3xxx_CONFIG_DATA_WRITE_OFFSET                     (1)
#define CY8CMBR3xxx_VERIFY_DEVICE_READ_BUFFER_LENGTH             (5)
#define CY8CMBR3xxx_VERIFY_DEVICE_FAMILYID_OFFSET                (0)
#define CY8CMBR3xxx_VERIFY_DEVICE_DEVID_LSB_OFFSET               (1)
#define CY8CMBR3xxx_VERIFY_DEVICE_DEVID_MSB_OFFSET               (2)
#define CY8CMBR3xxx_VERIFY_DEVICE_DEVREV_LSB_OFFSET              (3)
#define CY8CMBR3xxx_VERIFY_DEVICE_DEVREV_MSB_OFFSET              (4)
#define CY8CMBR3xxx_SENSORID_SEND_LENGTH                         (2)
#define CY8CMBR3xxx_SENSORID_OFFSET                              (1)
#define CY8CMBR3xxx_SENSOR_DATA_LENGTH                           (13)
#define CY8CMBR3xxx_SENSOR_DATA_SYNC1_OFFSET                     (0)
#define CY8CMBR3xxx_SENSOR_DATA_SENSOR_ID_OFFSET                 (1)
#define CY8CMBR3xxx_SENSOR_DATA_AVG_CNT_LSB_OFFSET               (9)
#define CY8CMBR3xxx_SENSOR_DATA_AVG_CNT_MSB_OFFSET               (10)
#define CY8CMBR3xxx_SENSOR_DATA_BASELINE_LSB_OFFSET              (5)
#define CY8CMBR3xxx_SENSOR_DATA_BASELINE_MSB_OFFSET              (6)
#define CY8CMBR3xxx_SENSOR_DATA_CP_OFFSET                        (2)
#define CY8CMBR3xxx_SENSOR_DATA_DIFFCOUNTS_LSB_OFFSET            (3)
#define CY8CMBR3xxx_SENSOR_DATA_DIFFCOUNTS_MSB_OFFSET            (4)
#define CY8CMBR3xxx_SENSOR_DATA_RAWCOUNTS_LSB_OFFSET             (7)
#define CY8CMBR3xxx_SENSOR_DATA_RAWCOUNTS_MSB_OFFSET             (8)
#define CY8CMBR3xxx_SENSOR_DATA_SYNC2_OFFSET                     (12)
#define CY8CMBR3xxx_DIFFCOUNT_DATA_LENGTH                        (35)
#define CY8CMBR3xxx_DIFFCOUNT_SYNC0_OFFSET                       (0)
#define CY8CMBR3xxx_DIFFCOUNT_SYNC1_OFFSET                       (34)
#define CY8CMBR3xxx_DIFFCOUNT_WIDTH                              (2)
#define CY8CMBR3xxx_DIFFCOUNT_LSB_OFFSET                         (1)
#define CY8CMBR3xxx_DIFFCOUNT_MSB_OFFSET                         (2)
#define CY8CMBR3xxx_SENSOR_STATUS_LENGTH                         (10)
#define CY8CMBR3xxx_BUTTONSTATUS_LSB_OFFSET                      (0)
#define CY8CMBR3xxx_BUTTONSTATUS_MSB_OFFSET                      (1)
#define CY8CMBR3xxx_LATCHEDBUTTONSTATUS_LSB_OFFSET               (2)
#define CY8CMBR3xxx_LATCHEDBUTTONSTATUS_MSB_OFFSET               (3)
#define CY8CMBR3xxx_PROXSTATUS_OFFSET                            (4)
#define CY8CMBR3xxx_LATCHEDPROXSTATUS_OFFSET                     (5)
#define CY8CMBR3xxx_SLIDER1POSITION_OFFSET                       (6)
#define CY8CMBR3xxx_LIFTOFFSLIDER1POSITION_OFFSET                (7)
#define CY8CMBR3xxx_SLIDER2POSITION_OFFSET                       (8)
#define CY8CMBR3xxx_LIFTOFFSLIDER2POSITION_OFFSET                (9)
#define CY8CMBR3xxx_BUFFER_INIT_VALUE                            (0x00)
#define CY8CMBR3xxx_CTRL_CMD_NO_ERROR                            (0)
#define CY8CMBR3xxx_DEFAULT_SENSOR_ID                            (0)
#define CY8CMBR3xxx_DEFAULT_CONFIG_INDEX                         (0)
#define CY8CMBR3xxx_BYTE_SHIFT_BITS                              (8)
#define CY8CMBR3xxx_BYTE_MASK                                    (0xFF)


