Q2499279972/CY8CMBR3xxx_Host_APIs/API/CY8CMBR3xxx_APIs.c
    /* Defines number of retries before returning fail status */
    uint8 retryCount = CY8CMBR3xxx_SYNC_COUNTER_MATCH_RETRY;
    
    /* Execute only if the slave address is valid */
    if (CY8CMBR3xxx_IS_VALID_ADDRESS(slaveAddress))
    {
        /* Use low level host API to move the register address to SYNC_COUNTER1 */
        localWriteBuffer[CY8CMBR3xxx_REG_ADDRESS_OFFSET] = CY8CMBR3xxx_SYNC_COUNTER1;            /* First byte is always the register address */
        if (Host_LowLevelWrite(slaveAddress, localWriteBuffer, CY8CMBR3xxx_REG_ADDRESS_LENGTH))
        {
            /* Use low level host API to read 13-bytes from device */
            do 
            {
                localStatus =  Host_LowLevelRead(slaveAddress, localReadBuffer, CY8CMBR3xxx_SENSOR_DATA_LENGTH);
            } while ((localStatus == TRUE) &&
                     (localReadBuffer[CY8CMBR3xxx_SENSOR_DATA_SYNC1_OFFSET] != localReadBuffer[CY8CMBR3xxx_SENSOR_DATA_SYNC2_OFFSET]) &&    /* To proceed SYNC_COUNTER1 should be equal to SYNC_COUNTER2 */
                     (--retryCount));                                                                               /* Try for a maximum of SYNC_COUNTER_MATCH_RETRY times */
            
            /* If retryCount is non-zero, and I2C transaction was successful - indicates sync counters matched */
            if (retryCount && localStatus)
            {
                /* Compute the required values from data read */
                debugData->sensorAverageCounts = (((uint16)localReadBuffer[CY8CMBR3xxx_SENSOR_DATA_AVG_CNT_MSB_OFFSET] << CY8CMBR3xxx_BYTE_SHIFT_BITS) 
                                                        | localReadBuffer[CY8CMBR3xxx_SENSOR_DATA_AVG_CNT_LSB_OFFSET]);
                debugData->sensorBaseline = (((uint16)localReadBuffer[CY8CMBR3xxx_SENSOR_DATA_BASELINE_MSB_OFFSET] << CY8CMBR3xxx_BYTE_SHIFT_BITS) 
                                                    | localReadBuffer[CY8CMBR3xxx_SENSOR_DATA_BASELINE_LSB_OFFSET]);
                debugData->sensorCp = localReadBuffer[CY8CMBR3xxx_SENSOR_DATA_CP_OFFSET];
                debugData->sensorDiffCounts = (((uint16)localReadBuffer[CY8CMBR3xxx_SENSOR_DATA_DIFFCOUNTS_MSB_OFFSET] << CY8CMBR3xxx_BYTE_SHIFT_BITS) 
                                                    | localReadBuffer[CY8CMBR3xxx_SENSOR_DATA_DIFFCOUNTS_LSB_OFFSET]);
                debugData->sensorRawCounts = (((uint16)localReadBuffer[CY8CMBR3xxx_SENSOR_DATA_RAWCOUNTS_MSB_OFFSET] << CY8CMBR3xxx_BYTE_SHIFT_BITS) 
                                                    | localReadBuffer[CY8CMBR3xxx_SENSOR_DATA_RAWCOUNTS_LSB_OFFSET]);
            }
        }
    }
    
    /* Return the status */
    return localStatus;
}

/*******************************************************************************
* Function Name: CY8CMBR3xxx_ReadDiffCounts
********************************************************************************
*
* Summary:
*  This API reads the Difference counts of all sensors of the CY8CMBR3xxx 
*  device and updates the data to a buffer.
*
*  The API updates the buffer only if the sync counters of the device match. 
*  In case they don’t, the API tries to read the data again. The maximum number
*  of read attempts is CY8CMBR3xxx_SYNC_COUNTER_MATCH_RETRY. You can set 
*  this value in CY8CMBR3xxx_APIs.h file.
*
* Parameters:
*  uint8 slaveAddress:
*   The I2C address of the CY8CMBR3xxx device. Valid range: 8 - 119
*
*  uint16 *differenceCounts:
*   Buffer to store the difference counts of all sensors. The buffer size 
*   should be equal to the number of sensors in the device.
*
* Return:
*  Status
*    Value                Description
*    TRUE                 Buffer was updated
*    FALSE                Buffer was not updated
*
*******************************************************************************/
bool CY8CMBR3xxx_ReadDiffCounts(uint8 slaveAddress, uint16 *differenceCounts)
{
    /* Default return is FALSE if anything goes wrong */
    bool localStatus = FALSE;
    
    /* Data to be written is the SYNC_COUNTER0 register address */
    uint8 localWriteBuffer[CY8CMBR3xxx_REG_ADDRESS_LENGTH] = {CY8CMBR3xxx_SYNC_COUNTER0};
    
    /* Buffer to read 35-bytes */
    uint8 localReadBuffer[CY8CMBR3xxx_DIFFCOUNT_DATA_LENGTH] = {CY8CMBR3xxx_BUFFER_INIT_VALUE};
    
    /* Defines number of retries before returning fail status */
    uint8 retryCount = CY8CMBR3xxx_SYNC_COUNTER_MATCH_RETRY;
    
    /* To keep a count on the Sensor ID locally */
    uint8 localSensor = CY8CMBR3xxx_DEFAULT_SENSOR_ID;
    
    /* Execute only if the slave address and buffer location are valid */
    if ((CY8CMBR3xxx_IS_VALID_ADDRESS(slaveAddress)) && (differenceCounts))
    {
        /* Use low level host API to move the register address to SYNC_COUNTER0 */
        if (Host_LowLevelWrite(slaveAddress, localWriteBuffer, CY8CMBR3xxx_REG_ADDRESS_LENGTH))
        {
            /* Use low level host API to read 35-bytes from device */
            do 
            {
                localStatus =  Host_LowLevelRead(slaveAddress, localReadBuffer, CY8CMBR3xxx_DIFFCOUNT_DATA_LENGTH);                    
            } while ((localStatus == TRUE) && 
                     (localReadBuffer[CY8CMBR3xxx_DIFFCOUNT_SYNC0_OFFSET] != localReadBuffer[CY8CMBR3xxx_DIFFCOUNT_SYNC1_OFFSET]) &&   /* To proceed SYNC_COUNTER0 should be equal to SYNC_COUNTER1 */
                     (--retryCount));                                                                          /* Try for a maximum of SYNC_COUNTER_MATCH_RETRY times */
            
            /* If retryCount is non-zero, and I2C transaction was successful - indicates sync counters matched */
            if (retryCount && localStatus)
            {
                /* Compute the required values from data read */
                for (localSensor = CY8CMBR3xxx_DEFAULT_SENSOR_ID; localSensor < CY8CMBR3xxx_SENSOR_COUNT; localSensor++)
                {
                    differenceCounts[localSensor] = (((uint16)localReadBuffer[(localSensor * CY8CMBR3xxx_DIFFCOUNT_WIDTH) + CY8CMBR3xxx_DIFFCOUNT_MSB_OFFSET] << CY8CMBR3xxx_BYTE_SHIFT_BITS) | 
                                                                    (localReadBuffer[(localSensor * CY8CMBR3xxx_DIFFCOUNT_WIDTH) + CY8CMBR3xxx_DIFFCOUNT_LSB_OFFSET]));
                }
            }
        }
    }
    
    /* Return the status */
    return localStatus;
}

