Q2499279972/CY8CMBR3xxx_Host_APIs/API/CY8CMBR3xxx_APIs.c
/*******************************************************************************
* Function Name: CY8CMBR3xxx_ReadSensorStatus
********************************************************************************
*
* Summary:
*  This API reads the button status, latched button status, proximity status, 
*  latched proximity status, slider 1 and 2 positions, and slider 1 and 2 liftoff 
*  positions from the CY8CMBR3xxx device.
*  The slider positions and slider liftoff positions are valid for CY8CMBR3106S 
*  device only.
*
*  You can use this API when the device asserts a Host Interrupt pulse, to 
*  understand the corresponding status change.
*
* Parameters:
*  uint8 slaveAddress:
*   The I2C address of the CY8CMBR3xxx device. Valid range: 8 - 119
*
*  CY8CMBR3xxx_SENSORSTATUS *status:
*   Pointer to the user-defined buffer where the sensor status read from 
*   the CY8CMBR3xxx device is stored. The buffer structure should be as 
*   defined in CY8CMBR3xxx_APIs.h.
*
* Return:
*  Status
*    Value                Description
*    TRUE                 Buffer was updated
*    FALSE                Buffer was not updated
*
*******************************************************************************/
bool CY8CMBR3xxx_ReadSensorStatus(uint8 slaveAddress, CY8CMBR3xxx_SENSORSTATUS *status)
{
    /* Default return is FALSE if anything goes wrong */
    bool localStatus = FALSE;                                                    
    
    /* Data to be written is the BUTTON_STAT register address */
    uint8 localWriteBuffer[CY8CMBR3xxx_REG_ADDRESS_LENGTH] = {CY8CMBR3xxx_BUTTON_STAT};
    
    /* Buffer to read 10-bytes */
    uint8 localReadBuffer[CY8CMBR3xxx_SENSOR_STATUS_LENGTH] = {CY8CMBR3xxx_BUFFER_INIT_VALUE};           
    
    /* Execute only if the slave address is valid */
    if (CY8CMBR3xxx_IS_VALID_ADDRESS(slaveAddress))
    {
        /* Use low level host API to write the register address first */
        if (Host_LowLevelWrite(slaveAddress, localWriteBuffer, CY8CMBR3xxx_REG_ADDRESS_LENGTH))
        {
            /* Use low level host API to read 10-bytes from device */
            if (Host_LowLevelRead(slaveAddress, localReadBuffer, CY8CMBR3xxx_SENSOR_STATUS_LENGTH))
            {
                /* Compute the required values from data read */
                status->buttonStatus = ((uint16)localReadBuffer[CY8CMBR3xxx_BUTTONSTATUS_MSB_OFFSET] << CY8CMBR3xxx_BYTE_SHIFT_BITS) 
                                                    | localReadBuffer[CY8CMBR3xxx_BUTTONSTATUS_LSB_OFFSET];
                status->latchedButtonStatus = ((uint16)localReadBuffer[CY8CMBR3xxx_LATCHEDBUTTONSTATUS_MSB_OFFSET] << CY8CMBR3xxx_BYTE_SHIFT_BITS) 
                                                    | localReadBuffer[CY8CMBR3xxx_LATCHEDBUTTONSTATUS_LSB_OFFSET];
                status->proxStatus = localReadBuffer[CY8CMBR3xxx_PROXSTATUS_OFFSET];
                status->latchedProxStatus = localReadBuffer[CY8CMBR3xxx_LATCHEDPROXSTATUS_OFFSET];
                status->slider1Position = localReadBuffer[CY8CMBR3xxx_SLIDER1POSITION_OFFSET];
                status->liftoffSlider1Position = localReadBuffer[CY8CMBR3xxx_LIFTOFFSLIDER1POSITION_OFFSET];
                status->slider2Position = localReadBuffer[CY8CMBR3xxx_SLIDER2POSITION_OFFSET];
                status->liftoffSlider2Position = localReadBuffer[CY8CMBR3xxx_LIFTOFFSLIDER2POSITION_OFFSET];
                
                localStatus = TRUE;
            }
        }
    }
    
    /* Return the status */
    return localStatus;
}

/****************************End of File***************************************/
